In [1]:
#adding column or inserting any column 
import pandas as pd 
data ={"name" : ['ram' , 'rohan' ,'geeta' ,'rahul' ,'sonam' ,'siya' ,'aman' ,'pooja'],
       "age" : [22 , 26 ,28,29,45,23,33,24],
       "salary" : [10000 ,50000,30000,400000,23000,900000,240000 , 700000]}
            
df = pd.DataFrame(data)
print("the simple data frame") 
print(df)

df["bonus"] = df["salary"]*0.01
print("added new column by using simple method ")
print(df)

df.insert(0 , "empoley_id" , [10,20,30,40,50,60,70,80])
print("added a new column by using insert method")
print(df)

the simple data frame
    name  age  salary
0    ram   22   10000
1  rohan   26   50000
2  geeta   28   30000
3  rahul   29  400000
4  sonam   45   23000
5   siya   23  900000
6   aman   33  240000
7  pooja   24  700000
added new column by using simple method
    name  age  salary   bonus
0    ram   22   10000   100.0
1  rohan   26   50000   500.0
2  geeta   28   30000   300.0
3  rahul   29  400000  4000.0
4  sonam   45   23000   230.0
5   siya   23  900000  9000.0
6   aman   33  240000  2400.0
7  pooja   24  700000  7000.0
added a new column by using insert method
   empoley_id   name  age  salary   bonus
0          10    ram   22   10000   100.0
1          20  rohan   26   50000   500.0
2          30  geeta   28   30000   300.0
3          40  rahul   29  400000  4000.0
4          50  sonam   45   23000   230.0
5          60   siya   23  900000  9000.0
6          70   aman   33  240000  2400.0
7          80  pooja   24  700000  7000.0

In [6]:
#updating data 

import pandas as pd 
data ={"name" : ['ram' , 'rohan' ,'geeta' ,'rahul' ,'sonam' ,'siya' ,'aman' ,'pooja'],
       "age" : [22 , 26 ,28,29,45,23,33,24],
       "salary" : [10000 ,50000,30000,400000,23000,900000,240000 , 700000]}
            
df = pd.DataFrame(data)
print("the simple data frame")
print(df)

df.loc[0 , "salary"] = 15000
print(df)

df["salary"] = df["salary"] *1.01
print(df)

the simple data frame
    name  age  salary
0    ram   22   10000
1  rohan   26   50000
2  geeta   28   30000
3  rahul   29  400000
4  sonam   45   23000
5   siya   23  900000
6   aman   33  240000
7  pooja   24  700000
    name  age  salary
0    ram   22   15000
1  rohan   26   50000
2  geeta   28   30000
3  rahul   29  400000
4  sonam   45   23000
5   siya   23  900000
6   aman   33  240000
7  pooja   24  700000
    name  age    salary
0    ram   22   15150.0
1  rohan   26   50500.0
2  geeta   28   30300.0
3  rahul   29  404000.0
4  sonam   45   23230.0
5   siya   23  909000.0
6   aman   33  242400.0
7  pooja   24  707000.0

In [6]:
# MISSING VALUES 

import pandas as pd 
data ={"name" : ['ram' , None ,'geeta' ,'rahul' ,'sonam' ,'siya' ,'aman' ,None],
       "age" : [22 , 26 ,28,29, None,23,33,24],
       "salary" : [10000 ,50000,None,400000,23000,900000,None , 700000]} 

df = pd.DataFrame(data) 
print(df)
print(df.isnull())
print(df.isnull().sum())

    name   age    salary
0    ram  22.0   10000.0
1   None  26.0   50000.0
2  geeta  28.0       NaN
3  rahul  29.0  400000.0
4  sonam   NaN   23000.0
5   siya  23.0  900000.0
6   aman  33.0       NaN
7   None  24.0  700000.0
    name    age  salary
0  False  False   False
1   True  False   False
2  False  False    True
3  False  False   False
4  False   True   False
5  False  False   False
6  False  False    True
7   True  False   False
name      2
age       1
salary    2
dtype: int64

In [17]:
# missing value 
# dropna() function - use to drop the missing value 
#axis = 0 (will drop rows)
#axis = 1 (will drop column)

import pandas as pd 
data ={"name" : ['ram' , None ,'geeta' ,'rahul' ,'sonam' ,'siya' ,'aman' ,None],
       "age" : [22 , 26 ,28,29, None,23,33,24],
       "salary" : [10000 ,50000,None,400000,23000,900000,None , 700000]} 

df = pd.DataFrame(data) 
df.dropna( inplace = True ) 
print(df)

    name   age    salary
0    ram  22.0   10000.0
3  rahul  29.0  400000.0
5   siya  23.0  900000.0

In [26]:
# mising values 
# fillna() function use to fill missing value 
import pandas as pd 
data ={"name" : ['ram' , None ,'geeta' ,'rahul' ,'sonam' ,'siya' ,'aman' ,None],
       "age" : [22 , 26 ,28,29, None,23,33,24],
       "salary" : [10000 ,50000,None,400000,23000,900000,None , 700000]} 

df = pd.DataFrame(data) 
df["age"].fillna( df["age"].mean() , inplace = True )
df["name"].fillna("rohan" , inplace= True)
df["salary"].fillna(df["salary"].mean() , inplace = True)
print(df)

    name        age         salary
0    ram  22.000000   10000.000000
1  rohan  26.000000   50000.000000
2  geeta  28.000000  347166.666667
3  rahul  29.000000  400000.000000
4  sonam  26.428571   23000.000000
5   siya  23.000000  900000.000000
6   aman  33.000000  347166.666667
7  rohan  24.000000  700000.000000

C:\Users\enggb\AppData\Local\Temp\ipykernel_28908\1637722976.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["age"].fillna( df["age"].mean() , inplace = True )
C:\Users\enggb\AppData\Local\Temp\ipykernel_28908\1637722976.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["name"].fillna("rohan" , inplace= True)
C:\Users\enggb\AppData\Local\Temp\ipykernel_28908\1637722976.py:11: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["salary"].fillna(df["salary"].mean() , inplace = True)

In [ ]:
# interpolate() function (to fill misisng value )
# preserve data intergritity 
#smooth trend 
# avoid data loss
#method - linear , polynomial , time

In [28]:
import pandas as pd 
data = {
    "time" :[1,2,3,4,5], "value" :[10,20,None , 40 , None ]}
df = pd.DataFrame(data)
print("before interpolation ")
print(df)
print("after interpolation")
df["value"] = df["value"].interpolate(method = "linear") 
print(df)

before interpolation
   time  value
0     1   10.0
1     2   20.0
2     3    NaN
3     4   40.0
4     5    NaN
after interpolation
   time  value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   40.0

In [34]:
import pandas as pd 
data ={"name" : ['ram' ,"Shyam" ,'geeta' ,'rahul' ,'sonam' ,'siya' ,'aman' ,"rekha"],
       "age" : [22 , None ,28,29, None,23,33,24],
       "salary" : [10000 ,50000,None,None,23000,900000,None , 700000]} 

df = pd.DataFrame(data) 
print("before")
print(df)
df.interpolate(method = "linear" , inplace = True)
print(df)

before
    name   age    salary
0    ram  22.0   10000.0
1  Shyam   NaN   50000.0
2  geeta  28.0       NaN
3  rahul  29.0       NaN
4  sonam   NaN   23000.0
5   siya  23.0  900000.0
6   aman  33.0       NaN
7  rekha  24.0  700000.0
    name   age    salary
0    ram  22.0   10000.0
1  Shyam  25.0   50000.0
2  geeta  28.0   41000.0
3  rahul  29.0   32000.0
4  sonam  26.0   23000.0
5   siya  23.0  900000.0
6   aman  33.0  800000.0
7  rekha  24.0  700000.0

C:\Users\enggb\AppData\Local\Temp\ipykernel_28908\1281545381.py:9: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method = "linear" , inplace = True)

In [2]:
#SORTING 

import pandas as pd 
data = {
    "name" : [ "ram" , "gopal" , "aman" , "sita"],
    "age" : [ 26 , 19 , 40, 32],
    "salary" : [9000 , 1000, 3000,8000]}

df = pd.DataFrame(data)
print("before sorting")
print(df)
df.sort_values(by = ["age" , "name", "salary"] , ascending = [ True , False, False] , inplace = True )
print(df)

before sorting
    name  age  salary
0    ram   26    9000
1  gopal   19    1000
2   aman   40    3000
3   sita   32    8000
    name  age  salary
1  gopal   19    1000
0    ram   26    9000
3   sita   32    8000
2   aman   40    3000

In [4]:
#AGGRESSION 
import pandas as pd 
data = {
    "name" : [ "ram" , "gopal" , "aman" , "sita"],
    "age" : [ 26 , 19 , 40, 32],
    "salary" : [9000 , 1000, 3000,8000]}

df = pd.DataFrame(data)
avg_salary = df["salary"].mean()
max_age = df["age"].max()
total_salary = df["salary"].sum()
min_salary = df["salary"].min()
print(avg_salary)
print(max_age)
print(total_salary)
print(min_salary)

5250.0
40
21000
1000

In [5]:
# GROUP BY 

import pandas as pd 
data = {
    "name" : [ "ram" , "gopal" , "aman" , "sita" , "geeta" , "sona"],
    "age" : [ 26 , 26 , 40, 32 , 40 , 32],
    "salary" : [9000 , 1000, 3000,8000 , 3400 , 9500]}

df = pd.DataFrame(data)
grouped = df.groupby("age")["salary"].sum()
print(grouped)

age
26    10000
32    17500
40     6400
Name: salary, dtype: int64

In [9]:
# MERGINING 

import pandas as pd 
customer = {
    "customer_id" :[1,2,3],
    "customer_name" :["rahul" ,"govind" , "sikhsha"]}

ordered = {
    "customer_id" :[1,2,4],
    "orderd" :[2000,60000 , 34000]}
df_customer = pd.DataFrame(customer)
df_ordered = pd.DataFrame(ordered)

merge1 = pd.merge(df_customer , df_ordered , on = "customer_id"  , how = "inner")
print("by using inner merge")
print(merge1)

merge2 = pd.merge(df_customer , df_ordered , on = "customer_id"   , how = "outer")
print("by using outer merge")
print(merge2)

merge3 = pd.merge(df_customer , df_ordered , on = "customer_id"  , how = "left")
print("by using left merge")
print(merge3)

merge4 = pd.merge(df_customer , df_ordered , on = "customer_id"  , how = "right")
print("by using right merge")
print(merge4)

by using inner merge
   customer_id customer_name  orderd
0            1         rahul    2000
1            2        govind   60000
by using outer merge
   customer_id customer_name   orderd
0            1         rahul   2000.0
1            2        govind  60000.0
2            3       sikhsha      NaN
3            4           NaN  34000.0
by using left merge
   customer_id customer_name   orderd
0            1         rahul   2000.0
1            2        govind  60000.0
2            3       sikhsha      NaN
by using right merge
   customer_id customer_name  orderd
0            1         rahul    2000
1            2        govind   60000
2            4           NaN   34000

In [12]:
#concat()

import pandas as pd 
customer = {
    "customer_id" :[1,2,3],
    "customer_name" :["rahul" ,"govind" , "sikhsha"]}

ordered = {
    "customer_id" :[1,2,4],
    "orderd" :[2000,60000 , 34000]}
df_customer = pd.DataFrame(customer)
df_ordered = pd.DataFrame(ordered)

concatenate = pd.concat([df_customer , df_ordered])
print(concatenate)

   customer_id customer_name   orderd
0            1         rahul      NaN
1            2        govind      NaN
2            3       sikhsha      NaN
0            1           NaN   2000.0
1            2           NaN  60000.0
2            4           NaN  34000.0